In [1]:
import pandas as pd
import numpy as np

In [4]:
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'])

data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data)

data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data, index=['rank1','rank2','rank3','rank4'])

data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data)

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [11]:
data =  {
    "Name":np.array(["Ahmad","Mourad","Fade"]),
    "Age":[33,43,25]
}

df = pd.DataFrame(data)

# Add Column
df['Salary'] = [2000,1500,2330]



# Delete Column
del df['Age'] # you can also use df.pop("Age")

     Name  Salary
0   Ahmad    2000
1  Mourad    1500
2    Fade    2330

In [23]:
print()

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)

print(df.loc['a'])  # get the row with the index label 'a'
print(df.iloc[0]) # get the row with the index 0

print(df[:2])

one    1.0
two    1.0
Name: a, dtype: float64
one    1.0
two    1.0
Name: a, dtype: float64
   one  two
a  1.0    1
b  2.0    2

In [28]:
# Addition
df = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])

df = df.append(df2,ignore_index=True)
 
#Deletetion
df = df.drop(0)
df

   a  b
1  3  4
2  5  6
3  7  8

In [39]:
#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack']),
   'Age':pd.Series([25,26,25,23,30,29,23]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8])}

#Create a DataFrame
df = pd.DataFrame(d)
df.T
df.shape # num of rows and columns

df.head(3) # View the FIRST n rows
df.tail(2) # View the LAST n rows

    Name  Age  Rating
5  Smith   29     4.6
6   Jack   23     3.8

In [60]:
#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
}

#Create a DataFrame
df = pd.DataFrame(d)

# These methods work on numerical columns
df.mean()
df.median()
df.std()
df.describe()
df.describe(include='all')

          Name        Age     Rating
count       12  12.000000  12.000000
unique      12        NaN        NaN
top     Gasper        NaN        NaN
freq         1        NaN        NaN
mean       NaN  31.833333   3.743333
std        NaN   9.232682   0.661628
min        NaN  23.000000   2.560000
25%        NaN  25.000000   3.230000
50%        NaN  29.500000   3.790000
75%        NaN  35.500000   4.132500
max        NaN  51.000000   4.800000

In [71]:
# Row Or Column wise functions

print()
df = pd.DataFrame(np.random.randn(5,3),columns=['col1','col2','col3'])
print(df)
df.apply(np.mean)
df.apply(np.mean,axis=1)
df.apply(lambda x: x.max()-x.min())

       col1      col2      col3
0 -0.591975  0.967962 -0.973199
1 -0.929951  2.622358 -0.749463
2 -0.302351  1.142485  0.007996
3 -0.743143 -1.949974  0.729498
4 -0.643820  0.462791 -0.015588

col1    0.627600
col2    4.572332
col3    1.702697
dtype: float64

In [81]:
# Element Wise Functions
print()
df = pd.DataFrame(np.random.randn(5,3),columns=['col1','col2','col3'])
print(df)

df['col1'] = df['col1'].map(lambda x:x+100)
df.apply(np.mean)

       col1      col2      col3
0  0.842462 -0.325174  0.316701
1  0.173557  0.572638  1.035726
2 -1.588336 -0.028024 -0.447605
3 -0.599578 -1.221252 -1.620921
4  1.918445  0.798153 -1.627157

col1    100.149310
col2     -0.040732
col3     -0.468651
dtype: float64

In [92]:

N=20

df = pd.DataFrame({
   'A': pd.date_range(start='2016-01-01',periods=N,freq='D'),
   'x': np.linspace(0,stop=N-1,num=N),
   'y': np.random.rand(N),
   'C': np.random.choice(['Low','Medium','High'],N).tolist(),
   'D': np.random.normal(100, 10, size=(N)).tolist()
})

#reindex the DataFrame
df_reindexed = df.reindex(index=[0,2,5], columns=['A', 'C', 'x',"new-col"],fill_value=0)

df_reindexed

# rename a column / index
df_reindexed = df_reindexed.rename(columns={'c' : 'temperature', 'new-col' : 'New Col'},
index = {0 : 'first-row'})

df_reindexed

                   A     C    x  New Col
first-row 2016-01-01   Low  0.0        0
2         2016-01-03  High  2.0        0
5         2016-01-06  High  5.0        0

In [97]:
df = pd.DataFrame(np.random.randn(4,3),columns = ['col1','col2','col3'])

for col in df:
   print (col)

print('--------------')
for row_index,row in df.iterrows():
   print (row_index,row)

print('--------------')
for key,value in df.iteritems():
   print (key,value)

col1
col2
col3
--------------
0 col1    1.584320
col2   -0.569476
col3   -1.391923
Name: 0, dtype: float64
1 col1    0.828875
col2   -1.687485
col3   -1.063971
Name: 1, dtype: float64
2 col1    0.889325
col2   -0.126958
col3   -0.258738
Name: 2, dtype: float64
3 col1   -1.358628
col2   -0.271193
col3   -0.185457
Name: 3, dtype: float64
--------------
col1 0    1.584320
1    0.828875
2    0.889325
3   -1.358628
Name: col1, dtype: float64
col2 0   -0.569476
1   -1.687485
2   -0.126958
3   -0.271193
Name: col2, dtype: float64
col3 0   -1.391923
1   -1.063971
2   -0.258738
3   -0.185457
Name: col3, dtype: float64

In [103]:
unsorted_df = pd.DataFrame(np.random.randn(10,2),index=[1,4,6,2,3,5,9,8,0,7],columns = ['col2','col1'])

sorted_df=unsorted_df.sort_index() # sort by index
sorted_df = unsorted_df.sort_index(ascending=False)
sorted_df=unsorted_df.sort_index(axis=1) # sort by cols
sorted_df


# Sorting by value
unsorted_df = pd.DataFrame({'col1':[2,1,1,1],'col2':[1,3,2,4]})
sorted_df = unsorted_df.sort_values(by='col1')
sorted_df

   col1  col2
1     1     3
2     1     2
3     1     4
0     2     1

In [108]:
# Strings Manipulation

s = pd.Series(['Tom', 'William Rick', 'John', 'Alber@t', np.nan, '1234','SteveSmith'])

s.str.lower()

0    0.0
1   -1.0
2   -1.0
3   -1.0
4    NaN
5   -1.0
6   -1.0
dtype: float64

In [133]:
# Slicing And indexing


df = pd.DataFrame(np.random.randn(8, 4),
index = ['a','b','c','d','e','f','g','h'], columns = ['A', 'B', 'C', 'D'])


df.loc[:,'A']   #select all rows for a specific column
df.loc[:,['A','C']]

df.loc[['a','b','f','h'],['A','C']]    # Select few rows for multiple columns
df.loc['a':'h']     # Select range of rows for all columns


# Integer slicing
df.iloc[:4]
df.iloc[1:5, 2:4]
df.iloc[[1, 3, 5], [0, 1, 3]]


# Indexing
df['A']
df[['A','B']]
df[:2]

          A         B         C         D
a  0.054603  1.019214  1.113611  1.453232
b  0.189807  0.312788 -0.318411 -0.968109

In [135]:

df = pd.DataFrame(np.random.randn(3, 3), index=['a', 'c', 'e'],columns=['one',
'two', 'three'])

df = df.reindex(['a', 'b', 'c'])

print (df)
print ("NaN replaced with '0':")
print (df.fillna(0))

print( df.dropna()) # Drop the row containing NaN values

df = pd.DataFrame({'one':[10,20,30,40,50,2000], 'two':[1000,0,30,40,50,60]})
print (df.replace({1000:10,2000:60}))

one       two     three
a -0.028480 -0.067908  0.605014
b       NaN       NaN       NaN
c  0.237393 -0.344764 -0.509394
NaN replaced with '0':
        one       two     three
a -0.028480 -0.067908  0.605014
b  0.000000  0.000000  0.000000
c  0.237393 -0.344764 -0.509394
        one       two     three
a -0.028480 -0.067908  0.605014
c  0.237393 -0.344764 -0.509394
   one  two
0   10   10
1   20    0
2   30   30
3   40   40
4   50   50
5   60   60

In [6]:

ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)

print (df.groupby('Team').groups)

{'Devils': Int64Index([2, 3], dtype='int64'), 'Kings': Int64Index([4, 6, 7], dtype='int64'), 'Riders': Int64Index([0, 1, 8, 11], dtype='int64'), 'Royals': Int64Index([9, 10], dtype='int64'), 'kings': Int64Index([5], dtype='int64')}

In [10]:

ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)

grouped = df.groupby('Year')

for name,group in grouped:
   print (name)
   print (group)

2014
     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701
2015
      Team  Rank  Year  Points
1   Riders     2  2015     789
3   Devils     3  2015     673
5    kings     4  2015     812
10  Royals     1  2015     804
2016
     Team  Rank  Year  Points
6   Kings     1  2016     756
8  Riders     2  2016     694
2017
      Team  Rank  Year  Points
7    Kings     1  2017     788
11  Riders     2  2017     690

In [11]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)

grouped = df.groupby('Year')
print (grouped.get_group(2014))

Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701

In [12]:

ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)

grouped = df.groupby('Year')
print (grouped['Points'].agg(np.mean))

Year
2014    795.25
2015    769.50
2016    725.00
2017    739.00
Name: Points, dtype: float64

In [15]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'Kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
print()
print(df)
# Attribute Access in Python Pandas
grouped = df.groupby('Team')
print (grouped.agg(np.size))

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690
        Rank  Year  Points
Team
Devils     2     2       2
Kings      4     4       4
Riders     4     4       4
Royals     2     2       2

In [31]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)

grouped = df.groupby('Team')
print()
# print (grouped['Points'].agg([np.sum, np.mean, np.std]))

df.groupby('Team').filter(lambda x: len(x)>=3)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
4    Kings     3  2014     741
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
11  Riders     2  2017     690

In [34]:
left = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5']})
right = pd.DataFrame({
	'id':[1,2,3,4,5],
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5']})

pd.merge(left,right,on='id')

pd.merge(left,right,on=['id','subject_id'])

   id  Name_x subject_id Name_y
0   4   Alice       sub6  Bryce
1   5  Ayoung       sub5  Betty

In [35]:
left = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5']})
right = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5']})

pd.merge(left, right, on='subject_id', how='left')

   id_x  Name_x subject_id  id_y Name_y
0     1    Alex       sub1   NaN    NaN
1     2     Amy       sub2   1.0  Billy
2     3   Allen       sub4   2.0  Brian
3     4   Alice       sub6   4.0  Bryce
4     5  Ayoung       sub5   5.0  Betty